app/helpers/search_helper.rb

SELECT  "watchlists".* FROM "watchlists" WHERE "watchlists"."user_id" = $1 ORDER BY "watchlists"."id" DESC LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
---
    def watchlist
        watchlists = []
        company = {}

        current_user.watchlists.each do |watchlist|