app/helpers/watchlist_helper.rb

    def watchlist

        watchlists = []
        company = {}
        scores = []


        current_user.watchlists.each do |watchlist|
---
SELECT "watchlists".* FROM "watchlists" WHERE "watchlists"."user_id" = $1  [["user_id", 2]]

        def search_index

            watchlists = []
            company = {}

            current_user.watchlists.each do |watchlist|
---
SELECT "watchlists".* FROM "watchlists" WHERE "watchlists"."user_id" = $1  [["user_id", 2]]