app/views/watchlist/_watchlist.html.erb

    <% if current_page?(search_index_path) %>
        <% if !Watchlist.find_by(user_id:current_user.id ,name: @company.fetch(:ticker)) %>
---
SELECT  "watchlists".* FROM "watchlists" WHERE "watchlists"."user_id" = $1 AND "watchlists"."name" = $2 LIMIT $3  [["user_id", 3], ["name", "FB"], ["LIMIT", 1]]