app/controllers/search_controller.rb

SELECT  "watchlists".* FROM "watchlists" WHERE "watchlists"."user_id" = $1 ORDER BY "watchlists"."id" DESC LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
SELECT  1 AS one FROM "watchlists" WHERE "watchlists"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT  "watchlists".* FROM "watchlists" WHERE "watchlists"."user_id" = $1 ORDER BY "watchlists"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
	def index

		# set search word #
		if params[:searchword]
			security_name = params[:searchword]
		elsif user_signed_in? && current_user.watchlists.any?
			security_name = "#{current_user.watchlists.first.name}"

DELETE FROM "watchlists" WHERE "watchlists"."id" = $1  [["id", 1]]
---
	def destroy
	set_watchlist
    @watchlist.destroy

SELECT  "watchlists".* FROM "watchlists" WHERE "watchlists"."user_id" = $1 AND "watchlists"."name" = $2 LIMIT $3  [["user_id", 1], ["name", "GOOGL"], ["LIMIT", 1]]
---
	def set_watchlist
		@watchlist = Watchlist.find_by(user_id: current_user.id, name: params[:name])