app/controllers/watchlist_controller.rb

INSERT INTO "watchlists" ("name", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "FB"], ["created_at", "2018-09-10 16:57:04.667322"], ["updated_at", "2018-09-10 16:57:04.667322"], ["user_id", 1]]
---
  def create
    @watchlist = Watchlist.new(watchlist_params)
    respond_to do |format|
      if current_user
        if @watchlist.save

DELETE FROM "watchlists" WHERE "watchlists"."id" = $1  [["id", 37]]
---
	def destroy
		if current_user
			set_watchlist
			@watchlist.destroy

SELECT  "watchlists".* FROM "watchlists" WHERE "watchlists"."user_id" = $1 AND "watchlists"."name" = $2 LIMIT $3  [["user_id", 1], ["name", "TSLA"], ["LIMIT", 1]]
---
	def set_watchlist
		@watchlist = Watchlist.find_by(user_id: current_user.id, name: params[:name])