app/views/application/_sidebar.html.erb

       <li class="dropdown">
     <% if user_signed_in? && current_user.watchlists.any? %>
---
SELECT  "watchlists".* FROM "watchlists" WHERE "watchlists"."user_id" = $1 ORDER BY "watchlists"."id" DESC LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
SELECT  1 AS one FROM "watchlists" WHERE "watchlists"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]

      <div class="dropdown-header">My Watchlists</div>
            <% current_user.watchlists.each do |watchlist| %>
---
SELECT "watchlists".* FROM "watchlists" WHERE "watchlists"."user_id" = $1  [["user_id", 1]]