app/views/application/_watchlist.html.erb

SELECT  "watchlists".* FROM "watchlists" WHERE "watchlists"."user_id" = $1 AND "watchlists"."name" = $2 LIMIT $3  [["user_id", 1], ["name", "GOOGL"], ["LIMIT", 1]]
---
 <div class="col-md-2 pl-0 pt-3 pb-0 pr-2 ">
  <% if Watchlist.find_by(user_id:current_user.id ,name: @company.fetch(:ticker)) %>